In [5]:
#define a function to add a element present in tuple. tuple will be given as asgument
def add(x):
    sum=0
    for i in x:
        sum=sum+i
    return sum
x=(1,2,3,4)
y=add(x)
print(y)

10

In [9]:
l1=[55,24,63,90]
l2=[12,85,89,12]
print(zip(l1,l2))

<zip object at 0x0000027C3A53E840>

In [10]:
print(list(zip(l1,l2)))

[(55, 12), (24, 85), (63, 89), (90, 12)]

In [17]:
l1=[55,24,63,90]
l2=[12,85,89,12]
l=(list(zip(l1,l2)))
l.sort(key=lambda x:x[1])
print(l)
l.sort()
print(l)

[(55, 12), (90, 12), (24, 85), (63, 89)]
[(24, 85), (55, 12), (63, 89), (90, 12)]

In [11]:
print(list(zip(l1,l2)))

[(55, 12), (24, 85), (63, 89), (90, 12)]

In [32]:
#open and write to a file that is not writable
f=open('file.txt','r')
f.write("I'm kushagra")
try:
    f.write("hello")
except:
    print(" not writable")

UnsupportedOperation: not writable

In [36]:
import pandas as pd
import numpy as np

# crete a sample dataframe
data = pd.DataFrame({
    'age' :     [ 10, 22, 13, 21, 12, 11, 17],
    'section' : [ 'A', 'B', 'C', 'B', 'B', 'A', 'A'],
    'city' :    [ 'Gurgaon', 'Delhi', 'Mumbai', 'Delhi', 'Mumbai', 'Delhi', 'Mumbai'],
    'gender' :  [ 'M', 'F', 'F', 'M', 'M', 'M', 'F'],
    'favourite_color' : [ 'red', np.NAN, 'yellow', np.NAN, 'black', 'green', 'red']
})

# view the data
data

   age section     city gender favourite_color
0   10       A  Gurgaon      M             red
1   22       B    Delhi      F             NaN
2   13       C   Mumbai      F          yellow
3   21       B    Delhi      M             NaN
4   12       B   Mumbai      M           black
5   11       A    Delhi      M           green
6   17       A   Mumbai      F             red

In [37]:
data.loc[(data.age >= 20), ['section', 'city']] = ['S','Pune']
data

   age section     city gender favourite_color
0   10       A  Gurgaon      M             red
1   22       S     Pune      F             NaN
2   13       C   Mumbai      F          yellow
3   21       S     Pune      M             NaN
4   12       B   Mumbai      M           black
5   11       A    Delhi      M           green
6   17       A   Mumbai      F             red

In [45]:
#Qno- By importing required module create a dataframe.Display the dataframe {'Brand' : ['Maruti', 'Hyundai', 'Tata', 'Mahindra', 'Maruti', 'Hyundai', 'Renault', 'Tata', 'Maruti'], 'Year' : [2012, 2014, 2011, 2015, 2012,
#2016, 2014, 2018, 2019], 'Kms Driven' : [50000, 30000, 60000,
#25000, 10000, 46000,
#31000, 15000, 12000], 'City' : ['Gurgaon', 'Delhi', 'Mumbai',
#'Delhi', 'Mumbai', 'Delhi',
#'Mumbai','Chennai', 'Ghaziabad'], 'Mileage' : [28, 27, 25, 26, 28,29, 24, 21, 24]}
import pandas as pd
data = pd.DataFrame({'Brand' : ['Maruti', 'Hyundai', 'Tata', 
                                'Mahindra', 'Maruti', 'Hyundai', 
                                'Renault', 'Tata', 'Maruti'], 
                     'Year' : [2012, 2014, 2011, 2015, 2012,  
                               2016, 2014, 2018, 2019], 
                     'Kms Driven' : [50000, 30000, 60000,  
                                     25000, 10000, 46000,  
                                     31000, 15000, 12000], 
                     'City' : ['Gurgaon', 'Delhi', 'Mumbai',  
                               'Delhi', 'Mumbai', 'Delhi',  
                               'Mumbai','Chennai',  'Ghaziabad'], 
                     'Mileage' :  [28, 27, 25, 26, 28,  
                                   29, 24, 21, 24]}) 
   
# displaying the DataFrame 
display(data)

      Brand  Year  Kms Driven       City  Mileage
0    Maruti  2012       50000    Gurgaon       28
1   Hyundai  2014       30000      Delhi       27
2      Tata  2011       60000     Mumbai       25
3  Mahindra  2015       25000      Delhi       26
4    Maruti  2012       10000     Mumbai       28
5   Hyundai  2016       46000      Delhi       29
6   Renault  2014       31000     Mumbai       24
7      Tata  2018       15000    Chennai       21
8    Maruti  2019       12000  Ghaziabad       24

In [41]:
#1.selecting cars with brand 'Maruti' and Mileage > 25
data.loc[(data.Brand == 'Maruti') & (data.Mileage > 25)]

    Brand  Year  Kms Driven     City  Mileage
0  Maruti  2012       50000  Gurgaon       28
4  Maruti  2012       10000   Mumbai       28

In [42]:
#.selecting range of rows from 2 to 5 
data.loc[2:5]

      Brand  Year  Kms Driven    City  Mileage
2      Tata  2011       60000  Mumbai       25
3  Mahindra  2015       25000   Delhi       26
4    Maruti  2012       10000  Mumbai       28
5   Hyundai  2016       46000   Delhi       29

In [53]:
#updating values of Mileage if Year < 2015
data.loc[(data.Year < 2015)]

     Brand  Year  Kms Driven     City  Mileage
0   Maruti  2012       50000  Gurgaon       28
1  Hyundai  2014       30000    Delhi       27
2     Tata  2011       60000   Mumbai       25
4   Maruti  2012       10000   Mumbai       28
6  Renault  2014       31000   Mumbai       24

In [52]:
#selecting rows from 1 to 4 and columns from 2 to 4
data.iloc[1:5 , 2:5]

   Kms Driven    City  Mileage
1       30000   Delhi       27
2       60000  Mumbai       25
3       25000   Delhi       26
4       10000  Mumbai       28

In [71]:
import pandas as pd
data=pd.DataFrame({'age':[30, 2, 12, 4, 32, 33, 69], 
                    'color':['blue', 'green', 'red', 'white', 'gray', 'black', 'red'],
                    'food':['Steak', 'Lamb', 'Mango', 'Apple', 'Cheese', 'Melon', 'Beans'],
                    'height':[165, 70, 120, 80, 180, 172, 150], 
                    'score':[4.6, 8.3, 9.0, 3.3, 1.8, 9.5, 2.2], 
                    'state':['NY', 'TX', 'FL', 'AL', 'AK', 'TX', 'TX']  } ,
                     index=['Jane', 'Nick', 'Aaron', 'Penelope', 'Dean', 'Christina', 'Cornelia'] )
 
display(data)

           age  color    food  height  score state
Jane        30   blue   Steak     165    4.6    NY
Nick         2  green    Lamb      70    8.3    TX
Aaron       12    red   Mango     120    9.0    FL
Penelope     4  white   Apple      80    3.3    AL
Dean        32   gray  Cheese     180    1.8    AK
Christina   33  black   Melon     172    9.5    TX
Cornelia    69    red   Beans     150    2.2    TX

In [72]:
*After creating perform the f
**After creating perform the following set of questions:- 
1.selecting column penelope
2.selecting columns cornelia,jane,dean 
3.selecting columns from aaron upto dean 
4.selecting 4th index column
5.selecting rows from 1 to 4 and 2nd column

SyntaxError: invalid syntax (<ipython-input-72-26f1c268f9f8>, line 1)

In [77]:
display(data.loc['Penelope'])

age           4
color     white
food      Apple
height       80
score       3.3
state        AL
Name: Penelope, dtype: object

In [79]:
display(data.loc[['Cornelia','Jane','Dean']])

          age color    food  height  score state
Cornelia   69   red   Beans     150    2.2    TX
Jane       30  blue   Steak     165    4.6    NY
Dean       32  gray  Cheese     180    1.8    AK

In [85]:
display(data.loc['Aaron':'Dean'])

          age  color    food  height  score state
Aaron      12    red   Mango     120    9.0    FL
Penelope    4  white   Apple      80    3.3    AL
Dean       32   gray  Cheese     180    1.8    AK

In [86]:
data.iloc[4]

age           32
color       gray
food      Cheese
height       180
score        1.8
state         AK
Name: Dean, dtype: object

In [87]:
data.iloc[1:5,2]

Nick          Lamb
Aaron        Mango
Penelope     Apple
Dean        Cheese
Name: food, dtype: object